#ifndef __util_h_
#define __util_h_

// ----------------------------------------------------------------
// ----------------------------------------------------------------
// ----------------------------------------------------------------

// ユーティリティ初期化
void utilGameInit();

// ----------------------------------------------------------------
// よく使う計算式

double utilCalcRotateDamper(double rot, double rotNext, double param);

// ----------------------------------------------------------------
// ----------------------------------------------------------------
// ----------------------------------------------------------------
// バージョンとユーザーID処理

char *utilPlatformGet();
char *utilUidGet();

// ----------------------------------------------------------------
// 時間処理

long long int utilTimeGet();

// ----------------------------------------------------------------

// web用体験版ロック
int utilLockedSelectIndex();

// web用編集ステージ
int utilEditedExist();
char *utilEditedGet();

// web用リプレイモード
int utilReplayExist();
int utilReplayGetStageId();
int utilReplayGetPuppetId();
char *utilReplayGetGravity(unsigned long *seed, int *length);

// ----------------------------------------------------------------
// twitter投稿

void utilTwitter(char *post);

// ----------------------------------------------------------------
// ----------------------------------------------------------------
// ----------------------------------------------------------------

#endif

